In [1]:
import pandas as pd

In [2]:
# load titanic dataset
titanic = pd.read_csv('titanic.csv')

In [6]:
# inspect the first 5 rows
titanic.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [7]:
titanic.tail()

                        Name PClass   Age   Sex  Survived  SexCode
1308      Zakarian, Mr Artun    3rd  27.0  male         0        0
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0        0
1310        Zenni, Mr Philip    3rd  22.0  male         0        0
1311        Lievens, Mr Rene    3rd  24.0  male         0        0
1312          Zimmerman, Leo    3rd  29.0  male         0        0

In [8]:
# inspect shape
titanic.shape

(1313, 6)

In [9]:
titanic.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
SexCode       int64
dtype: object

In [10]:
# show statistics using describe
titanic.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [12]:

titanic.Sex.value_counts(normalize=True)

male      0.648134
female    0.351866
Name: Sex, dtype: float64

In [15]:
from locale import normalize


titanic.PClass.value_counts(normalize=True)
titanic.PClass.value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

## navigating dataframe

In [16]:
titanic[titanic['PClass'] == '*']

                    Name PClass  Age   Sex  Survived  SexCode
456  Jacobsohn Mr Samuel      *  NaN  male         0        0

In [17]:
# select rows using iloc same as using index
titanic.iloc[1301]

Name        Wittevrongel, Mr Camiel
PClass                          3rd
Age                            36.0
Sex                            male
Survived                          0
SexCode                           0
Name: 1301, dtype: object

In [18]:
# select 3 or more rows using iloc
titanic.iloc[0:7]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1

In [21]:
# selecting rows based on conditions
# df[df.col == attrib]
ten_and_below =  titanic[titanic['Age'] <= 10]

In [22]:
ten_and_below.describe()

             Age   Survived    SexCode
count  55.000000  55.000000  55.000000
mean    4.343273   0.672727   0.490909
std     3.030649   0.473542   0.504525
min     0.170000   0.000000   0.000000
25%     2.000000   0.000000   0.000000
50%     4.000000   1.000000   0.000000
75%     6.500000   1.000000   1.000000
max    10.000000   1.000000   1.000000

In [24]:
# filtering rows based on multiple conditions
titanic[(titanic['Sex'] == 'female') & (titanic['Age'] <= 30)]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
11,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.0,female,1,1
23,"Bishop, Mrs Dickinson H (Helen Walton)",1st,19.0,female,1,1
...,...,...,...,...,...,...
1269,"Van der Planke, Miss Augusta",3rd,18.0,female,0,1
1276,"Van Impe, Miss Catharine",3rd,10.0,female,0,1
1278,"Van Impe, Mrs Jean Baptiste",3rd,30.0,female,0,1
1283,"Vestrom, Miss Hulda Amanda Adolfina",3rd,14.0,female,0,1
1304,"Yasbeck, Mrs Antoni",3rd,15.0,female,1,1

In [30]:
# replacing values
titanic['new sex'] = titanic['Sex'].replace('female', 'girl')

In [31]:
titanic.head()

,Name,PClass,Age,Sex,Survived,SexCode,new_sex,new sex
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,girl,girl
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,girl,girl
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,male,male
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,girl,girl
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,male,male

In [33]:
titanic['new sex'].head()

0    girl
1    girl
2    male
3    girl
4    male
Name: new sex, dtype: object

In [35]:
# renaming columns
#single column
titanic.rename(columns={
    'new sex' : 'new__sex'
})



# multiple columns
column_mapping = {
    'Name': 'name',
    'PClass': 'p_class'
}
titanic = titanic.rename(columns=column_mapping)
titanic.head()

,name,p_class,Age,Sex,Survived,SexCode,new_sex,new sex
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,girl,girl
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,girl,girl
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,male,male
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,girl,girl
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,male,male

In [36]:
# unique values
titanic.Survived.nunique()

2

In [38]:
# value counts
titanic.Survived.value_counts()

0    863
1    450
Name: Survived, dtype: int64

In [39]:
# check for missing values
# dataframe 
titanic.isna().sum()


# single column and subsetting

name          0
p_class       0
Age         557
Sex           0
Survived      0
SexCode       0
new_sex       0
new sex       0
dtype: int64

In [ ]:
# replace missing value with statistic
#assignment

In [40]:
# deleting a column
titanic = titanic.drop('new_sex', axis=1)

In [41]:
titanic.head()

,name,p_class,Age,Sex,Survived,SexCode,new sex
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,girl
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,girl
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,male
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,girl
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,male

In [42]:
# deleting multiple columns
titanic = titanic.drop(['new sex', 'SexCode'], axis=1)

In [43]:
titanic.head()

,name,p_class,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [44]:
titanic.shape

(1313, 5)

In [45]:
# dropping duplicates
titanic_dropped = titanic.drop_duplicates()

In [46]:
titanic.shape

(1313, 5)

## grouping columns and performing operations

In [50]:
# single columns
titanic.groupby('Sex').max()

                                                name p_class   Age  Survived
Sex
female  del Carlo, Mrs Sebastiano (Argenia Genovese)     3rd  69.0         1
male                        del Carlo, Mr Sebastiano     3rd  71.0         1

In [51]:
# group by multiple columns
titanic.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [52]:
# applying functions to elements in a column
def convert_lowercase(x):
    return x.lower()


titanic['name'].apply(convert_lowercase)

0                        allen, miss elisabeth walton
1                         allison, miss helen loraine
2                 allison, mr hudson joshua creighton
3       allison, mrs hudson jc (bessie waldo daniels)
4                       allison, master hudson trevor
                            ...
1308                               zakarian, mr artun
1309                           zakarian, mr maprieder
1310                                 zenni, mr philip
1311                                 lievens, mr rene
1312                                   zimmerman, leo
Name: name, Length: 1313, dtype: object

## concatenating and merging dataframes

In [54]:
# concatenate 2 dataframes

data_a = {'id': ['1', '2', '3'],
 'first': ['Alex', 'Amy', 'Allen'],
 'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])
# Create DataFrame
data_b = {'id': ['4', '5', '6'],
 'first': ['Billy', 'Brian', 'Bran'],
 'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])

final_df = pd.concat([dataframe_a, dataframe_b], axis=1)
final_df

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [55]:
# merging dataframes

# Create DataFrame
employee_data = {'employee_id': ['1', '2', '3', '4'],
 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
 'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id',
 'name'])
# Create DataFrame
sales_data = {'employee_id': ['3', '4', '5', '6'],
 'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id',
 'total_sales'])

In [56]:
dataframe_employees.head()

  employee_id        name
0           1   Amy Jones
1           2  Allen Keys
2           3  Alice Bees
3           4  Tim Horton

In [57]:
dataframe_sales.head()

  employee_id  total_sales
0           3        23456
1           4         2512
2           5         2345
3           6         1455

In [58]:
# inner
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='inner')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [59]:
# outer
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [60]:
# left
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [61]:
# right
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='right')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512
2           5         NaN         2345
3           6         NaN         1455

## assignment

1. groupby time
2. replace value in pclass columns with text
2. looping over a columm: loop through the name column and convert it to uppercase.
3. read on list compehensions and apply to number 2
4. applying functions to groupby